app/Controllers/AdminController.php

SELECT *
FROM `users`
---
    public function kelolaAkun()
    {
        $userModel = new UserModel();
        $data = [
            'users' => $userModel->findAll(),
            'title' => 'Kelola Akun'
        ];