app/Controllers/Auth.php

    public function processLogin()
    {
        $userModel = new UserModel();
        $usernameOrEmail = trim($this->request->getPost('username'));
        $password = $this->request->getPost('password');

        if (empty($usernameOrEmail) || empty($password)) {
            return redirect()->back()->with('error', 'Username dan password wajib diisi.');
        }

        $user = $userModel
            ->groupStart()
            ->where('LOWER(username)', strtolower($usernameOrEmail))
            ->orWhere('LOWER(email)', strtolower($usernameOrEmail))
            ->groupEnd()
            ->first();
---
SELECT *
FROM `users`
WHERE   (
LOWER(username) = 'pengguna1@gmail.com'
OR LOWER(email) = 'pengguna1@gmail.com'
 )
 LIMIT 1