app/Controllers/Auth.php

    public function saveRegister()
    {
        $userModel = new UserModel();
        $username = trim($this->request->getPost('username'));
        $email = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        if (empty($username) || empty($email) || empty($password)) {
            return redirect()->back()->with('error', 'Semua kolom wajib diisi.');
        }

        if ($userModel->where('email', $email)->orWhere('username', $username)->first()) {
---
SELECT *
FROM `users`
WHERE `email` = 'dionkristanto52@gmail.com'
OR `username` = 'SzhertchBer'
 LIMIT 1

    public function processLogin()
    {
        $userModel = new UserModel();
        $usernameOrEmail = trim($this->request->getPost('username'));
        $password = $this->request->getPost('password');

        if (empty($usernameOrEmail) || empty($password)) {
            return redirect()->back()->with('error', 'Username dan password wajib diisi.');
        }

        $user = $userModel->where('username', $usernameOrEmail)
                          ->orWhere('email', $usernameOrEmail)
                          ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1