app/Controllers/Banksoal.php

    public function detail($id = null)
    {
        if (!$id) {
            return redirect()->to(base_url('dashboard/pengajar/banksoal'))
                ->with('error', 'ID banksoal tidak ditemukan.');
        }

        $banksoal = $this->banksoal->find($id);
        if (!$banksoal) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // Ambil soal yang terkait
        $soalModel = new SoalModel();
        $soal = $soalModel->where('id_banksoal', $id)->findAll();
---
SELECT *
FROM `banksoal`
WHERE `banksoal`.`id_banksoal` = '1'
SELECT *
FROM `soal`
WHERE `id_banksoal` = '1'