app/Controllers/Dashboard.php

SELECT *
FROM `materi`
WHERE `materi`.`id` = '6'
---
    public function detailMateri($id)
{
    if (!$this->isAuthorized('penerima')) {
        return $this->accessDenied();
    }

    $materiModel = new \App\Models\MateriModel();

    $materi = $materiModel->find($id);