app/Controllers/Dashboard.php

SELECT *
FROM `mata_pelajaran`
ORDER BY `id` ASC
---
    public function penerima()
    {
        if (!$this->isAuthorized('penerima')) {
            return $this->accessDenied();
        }

        $mapelModel = new MataPelajaranModel();

        $data = [
            'title'    => 'Dashboard Penerima',
            'username' => session()->get('username'),
            'mapel'    => $mapelModel->orderBy('id', 'ASC')->findAll()