app/Controllers/Materi.php

    public function update($id)
    {
        $materi = $this->materiModel->find($id);
---
SELECT *
FROM `materi`
WHERE `materi`.`id` = '16'