app/Controllers/Pengajar.php

    public function tambah_quiz()
    {
        $bankModel = new BankSoalModel();
        $data['banksoal'] = $bankModel->findAll();
---
SELECT *
FROM `banksoal`