app/Controllers/Profil.php

SELECT *
FROM `users`
WHERE `users`.`id` = '34'
---
    private function getUser()
    {
        $id = session()->get('id');
        if (!$id) {
            return null;
        }
        return (new UserModel())->find($id);