app/Controllers/Soal.php

SELECT *
FROM `banksoal`
WHERE `banksoal`.`id_banksoal` = '1'
---
    public function create($id_banksoal = null)
    {
        if (!$id_banksoal) {
            return redirect()->back()->with('error', 'ID banksoal tidak ditemukan.');
        }

        $banksoal = $this->banksoal->find($id_banksoal);