app/Models/MateriModel.php

    public function getMateriByPengajar($pengajar)
    {
        return $this->select('materi.*, kategori.nama_kategori')
                    ->join('kategori', 'kategori.id = materi.id_kategori')
                    ->where('materi.pengajar', $pengajar)
                    ->orderBy('materi.id', 'DESC')
                    ->findAll();
---
SELECT `materi`.*, `kategori_mapel`.`nama_kategori`
FROM `materi`
JOIN `kategori_mapel` ON `kategori_mapel`.`id` = `materi`.`id_kategori`
WHERE `materi`.`pengajar` = 'dionpengajar'
ORDER BY `materi`.`id` DESC